import type { LocaleStrings } from '#cookie-control/types'

export default {
  accept: 'قبول',
  acceptAll: 'قبول الكل',
  acceptNecessary: 'قبول الضرورية فقط',
  bannerDescription:
    'نستخدم ملفات تعريف الارتباط الخاصة بنا وملفات تعريف الارتباط الخاصة بجهات خارجية حتى نتمكن من عرض هذا الموقع بشكل صحيح وفهم كيفية استخدامه بشكل أفضل، بهدف تحسين الخدمات التي نقدمها. يمكن تغيير قرار أذونات استخدام ملفات تعريف الارتباط في أي وقت باستخدام زر ملفات تعريف الارتباط الذي سيظهر بعد إجراء اختيار في هذا الشريط.',
  bannerTitle: 'ملفات تعريف الارتباط',
  buttonCookies: 'فتح إعدادات ملفات تعريف الارتباط',
  close: 'إغلاق',
  cookiesFunctional: 'ملفات تعريف الارتباط الوظيفية',
  cookiesNecessary: 'ملفات تعريف الارتباط الضرورية',
  cookiesOptional: 'ملفات تعريف الارتباط الاختيارية',
  declineAll: 'رفض الكل',
  here: 'هنا',
  iframeBlocked: 'لرؤية هذا، يرجى تمكين ملفات تعريف الارتباط الوظيفية',
  manageCookies: 'إدارة ملفات تعريف الارتباط',
  modalTitle: 'إعدادات ملفات تعريف الارتباط',
  save: 'حفظ',
  settingsUnsaved: 'لديك إعدادات غير محفوظة',
} as LocaleStrings
