import { I18n } from '../types'

export default {
  acceptAll: 'قبول الكل',
  acceptNecessary: 'تقبل الضرورة',
  barDescription:
    'نحن نستخدم ملفات تعريف الارتباط الخاصة بنا وملفات تعريف الارتباط الخاصة بالجهات الخارجية حتى نتمكن من عرض هذا الموقع وفهم كيفية استخدامه بشكل أفضل ، بهدف تحسين الخدمات التي نقدمها. إذا واصلت التصفح ، فإننا نعتبر أنك قبلت ملفات تعريف الارتباط.',
  barTitle: 'ملفات تعريف الارتباط',
  blockedIframe: 'لرؤية هذا ، يرجى تمكين ملفات تعريف الارتباط الوظيفية',
  close: 'إغلاق',
  declineAll: 'حذف الكل',
  functional: 'ملفات تعريف الارتباط الوظيفية',
  here: 'هنا',
  manageCookies: 'إدارة ملفات تعريف الارتباط',
  necessary: 'ملفات تعريف الارتباط الضرورية',
  optional: 'ملفات تعريف الارتباط الاختيارية',
  save: 'حفظ',
  unsaved: 'لديك إعدادات غير محفوظة',
} as I18n
