import { LocaleStrings } from '../types'

export default {
  accept: 'Приеми',
  acceptAll: 'Приеми всички',
  bannerDescription:
    'Ние използваме наши "бисквитки" и "бисквитки" от трети страни, за да можем да показваме правилно този уеб сайт и да разберем по-добре как се използва, с цел подобряване на предлаганите от нас услуги. Разрешението за използване на "бисквитки" може да бъде променено по всяко време, като се използва бутонът за бисквитки, който ще се появи след като бъде направен избор на този банер.',
  bannerTitle: '"Бисквитки"',
  close: 'Затвори',
  cookiesFunctional: 'Функционални "бисквитки"',
  cookiesNecessary: 'Нужни "бисквитки"',
  cookiesOptional: 'Незадължителни "бисквитки"',
  decline: 'Откажи',
  declineAll: 'Откажи всички',
  here: 'тук',
  iframeBlocked: 'За да видите това, моля, позволете функционалните "бисквитки"',
  manageCookies: 'Вижте повече и настройте',
  save: 'Запази',
  settingsUnsaved: 'Имате незапазени настройки',
} as LocaleStrings
