import type { LocaleStrings } from '#cookie-control/types'

export default {
  accept: 'ទទួលយក',
  acceptAll: 'ទទួលយកទាំងអស់',
  bannerDescription:
    'យើងប្រើអនុភាពខ្ពស់ និងបូជគណនីមួយដែលអនុវត្យឱ្យយើងបង្ហាញគំនូរនេះបានត្រឹមត្រូវ ហើយយើងកំពុងយល់ព្រមដល់វិធីដែលគោរពបានប្រើ ដើម្បីពង្រីកប្រសិនបើវាត្រូវបានប្រើដើម្បីធ្វើឱ្យប្រសើរឡើងលើសេវាកម្មយើងផ្ដល់អោយ។ សំណួរនៃការប្រើប្រាស់កម្មវិធីមួយអាចប្ដូរបានគ្រាន់តែមួយដែលមានស្ថានភាពជូនដំណឹងនៅក្នុងបណ្តាំងនេះ។',
  bannerTitle: 'កម្មវិធីជាមួយបបូរទុកទូលសម្រាប់គម្រោងយើង',
  buttonCookies: 'បើកការកំណត់កម្មវិធី',
  close: 'បិទ',
  cookiesFunctional: 'គម្រូបោះពុម្ពត្រឹមត្រូវ',
  cookiesNecessary: 'គម្រូសម្រាប់ទទួលយកត្រូវ',
  cookiesOptional: 'គម្រូសម្រាប់ទទួលយកជាមួយបាន',
  decline: 'បដិសេធ',
  declineAll: 'បដិសេធទាំងអស់',
  here: 'នៅទីនេះ',
  iframeBlocked: 'ដើម្បីមើលនេះ សូមបើកគម្រូបោះពុម្ពត្រឹមត្រូវ',
  manageCookies: 'សិក្សាអំពីលក្ខណៈពិសេស និងប្ដូរប្រភេទ',
  modalTitle: 'ការកំណត់កម្មវិធី',
  save: 'រក្សាទុក',
  settingsUnsaved: 'អ្នកមានការកំណត់ដែលមិនបានរក្សាទុក',
} as LocaleStrings
