import type { LocaleStrings } from '#cookie-control/types'

export default {
  accept: 'ទទួលយក',
  acceptAll: 'ទទួលយកទាំងអស់',
  acceptNecessary: 'ទទួលយកតែខូគីចាំបាច់',
  bannerDescription:
    'យើងប្រើខូគីផ្ទាល់ខ្លួន និងខូគីរបស់ភាគីទីបី ដើម្បីបង្ហាញគេហទំព័រនេះបានត្រឹមត្រូវ និងយល់កាន់តែច្បាស់ពីរបៀបដែលគេហទំព័រនេះត្រូវបានប្រើប្រាស់ ក្នុងគោលបំណងកែលម្អសេវាកម្មដែលយើងផ្តល់ជូន។ ការសម្រេចចិត្តអំពីការអនុញ្ញាតប្រើប្រាស់ខូគីអាចផ្លាស់ប្តូរបានគ្រប់ពេល ដោយប្រើប៊ូតុងខូគីដែលនឹងបង្ហាញឡើងបន្ទាប់ពីអ្នកបានធ្វើការជ្រើសរើសនៅលើបដានេះ។',
  bannerTitle: 'ខូគី',
  buttonCookies: 'បើកការកំណត់ខូគី',
  close: 'បិទ',
  cookiesFunctional: 'ខូគីមុខងារ',
  cookiesNecessary: 'ខូគីចាំបាច់',
  cookiesOptional: 'ខូគីជម្រើស',
  declineAll: 'បដិសេធទាំងអស់',
  here: 'នៅទីនេះ',
  iframeBlocked: 'ដើម្បីមើលខ្លឹមសារនេះ សូមបើកខូគីមុខងារ',
  manageCookies: 'ស្វែងយល់បន្ថែម និងកំណត់តាមចិត្ត',
  modalTitle: 'ការកំណត់ខូគី',
  save: 'រក្សាទុក',
  settingsUnsaved: 'អ្នកមានការកំណត់ដែលមិនបានរក្សាទុក',
} as LocaleStrings
